const propertyData = [
  {
    value: "clear",
    text: "ดูทั้งหมด",
  },
  {
    value: "02",
    text: "บ้านเดี่ยว",
  },
  {
    value: "01",
    text: "ที่ดิน",
  },
  {
    value: "03",
    text: "ทาวน์เฮ้าส์",
  },
  {
    value: "05",
    text: "คอนโดมิเนียม",
  },
  {
    value: "04",
    text: "อาคารพาณิชย์",
  },
  {
    value: "12",
    text: "โกดัง",
  },
  {
    value: "09",
    text: "โรงงาน",
  },
  {
    value: "10",
    text: "อาคารสำนักงาน",
  },
  {
    value: "17",
    text: "ห้องชุดสำนักงาน",
  },
  {
    value: "15",
    text: "อพาร์ทเม้นท์",
  },
  {
    value: "19",
    text: "อื่นๆ",
  },
];

const priceData = [
  {
    value: "clear",
    text: "ดูทั้งหมด",
  },
  {
    value: "0-1000000",
    text: "ต่ำกว่า 1 ล้าน",
  },
  {
    value: "1000000-3000000",
    text: "1 - 3 ล้านบาท",
  },
  {
    value: "3000000-5000000",
    text: "3 - 5 ล้านบาท",
  },
  {
    value: "5000000-10000000",
    text: "5 - 10 ล้านบาท",
  },
  {
    value: "10000000-20000000",
    text: "10 - 20 ล้านบาท",
  },
  {
    value: "20000000",
    text: "มากกว่า 20 ล้านบาทขึ้นไป",
  },
];

const areaData = [
  {
    value: "clear",
    text: "ดูทั้งหมด",
  },
  {
    value: "0-400",
    text: "ต่ำกว่า 100 ตร.วา",
  },
  {
    value: "401-800",
    text: "101 - 200 ตร.วา",
  },
  {
    value: "801-1200",
    text: "201 - 300 ตร.วา",
  },
  {
    value: "1201-1600",
    text: "301 - 400 ตร.วา",
  },
  {
    value: "1601-8000",
    text: "1 - 5 ไร่",
  },
  {
    value: "8001-16000",
    text: "5 - 10 ไร่",
  },
  {
    value: "16000",
    text: "10 ไร่ขึ้นไป",
  },
];

const usableAreaData = [
  {
    value: "clear",
    text: "ดูทั้งหมด",
  },
  {
    value: "0-50",
    text: "ต่ำกว่า 50 ตร.ม.",
  },
  {
    value: "50-100",
    text: "50 - 100 ตร.ม.",
  },
  {
    value: "101-200",
    text: "101 - 200 ตร.ม.",
  },
  {
    value: "301-400",
    text: "301 - 400 ตร.ม.",
  },
  {
    value: "1601-8000",
    text: "1 - 5 ไร่",
  },
  {
    value: "8001-16000",
    text: "5 - 10 ไร่",
  },
  {
    value: "16000",
    text: "10 ไร่ขึ้นไป",
  },
];